In [1]:
import pandas as pd
#from google.colab import files

In [2]:
#uploaded = files.upload()

In [3]:
#import io
data = pd.read_excel('Student.xlsx')
print(data.head())

  Unnamed: 0     City Country  Maths  Science
0       John   Mumbai   India     42        6
1      Alice   London      UK     44       77
2        Bob   London      UK     43       59
3       Mary  Florida     USA     26       49
4        Dan   Madrid   Spain     82       58

In [8]:
#making index
pd.read_excel("Student.xlsx",index_col=0)

          City Country  Maths  Science
John    Mumbai   India     42        6
Alice   London      UK     44       77
Bob     London      UK     43       59
Mary   Florida     USA     26       49
Dan     Madrid   Spain     82       58

In [10]:
pd.read_excel("Student.xlsx",index_col=0,usecols="A:C")

          City Country
John    Mumbai   India
Alice   London      UK
Bob     London      UK
Mary   Florida     USA
Dan     Madrid   Spain

In [12]:
#name columns
pd.read_excel("Student.xlsx",index_col=0,usecols="A:C",names=['Name','City','Country'])

          City Country
Name
John    Mumbai   India
Alice   London      UK
Bob     London      UK
Mary   Florida     USA
Dan     Madrid   Spain

In [15]:
pd.read_excel("Student.xlsx",index_col=0,names=['Name','City','Country','Math','Science'])

          City Country  Math  Science
Name
John    Mumbai   India    42        6
Alice   London      UK    44       77
Bob     London      UK    43       59
Mary   Florida     USA    26       49
Dan     Madrid   Spain    82       58

In [8]:
#last columns
pd.read_excel("Student.xlsx",index_col=0,usecols="C:F")

         Maths  Science
Country
India       42        6
UK          44       77
UK          43       59
USA         26       49
Spain       82       58

In [9]:
pd.read_excel("Student.xlsx",index_col=0,usecols=[0,2,4])

      Country  Science
John    India        6
Alice      UK       77
Bob        UK       59
Mary      USA       49
Dan     Spain       58

In [10]:
pd.read_excel("Student.xlsx",index_col=0,usecols=[0,4])

       Science
John         6
Alice       77
Bob         59
Mary        49
Dan         58

In [11]:
pd.read_excel("Student.xlsx",index_col=0,usecols=[2])

Empty DataFrame
Columns: []
Index: [India, UK, UK, USA, Spain]

In [12]:
pd.read_excel("Student.xlsx",index_col=0,usecols=2)

C:\Users\gauth\Anaconda3\lib\site-packages\pandas\io\excel.py:527: FutureWarning: Passing in an integer for `usecols` has been deprecated. Please pass in a list of int from 0 to `usecols` inclusive instead.
  usecols = _maybe_convert_usecols(usecols)

          City Country
John    Mumbai   India
Alice   London      UK
Bob     London      UK
Mary   Florida     USA
Dan     Madrid   Spain

In [13]:
#sheet navigation
pd.read_excel("Student.xlsx",index_col=0,sheet_name=0)

          City Country  Maths  Science
John    Mumbai   India     42        6
Alice   London      UK     44       77
Bob     London      UK     43       59
Mary   Florida     USA     26       49
Dan     Madrid   Spain     82       58

In [14]:
pd.read_excel("Student.xlsx",index_col=0,sheet_name=1)

                   City     Country Degree Specialization
Manish Sharma    Mumbai       India    MSC          Maths
M Chowdhury       Delhi       India    B.A        Physics
A Chow            Perth  Austrailia    PHD          Maths
David           Colombo   Sri Lanka    BBM        Parmacy
Samyaul Hridoy  Newyork         USA    Bsc       Medicine

In [15]:
pd.read_excel("Student.xlsx",index_col=0,sheet_name='teacher')

                   City     Country Degree Specialization
Manish Sharma    Mumbai       India    MSC          Maths
M Chowdhury       Delhi       India    B.A        Physics
A Chow            Perth  Austrailia    PHD          Maths
David           Colombo   Sri Lanka    BBM        Parmacy
Samyaul Hridoy  Newyork         USA    Bsc       Medicine

In [16]:
pd.read_excel("Student.xlsx",index_col=0,sheet_name='teacher',skiprows=[0,1])

                  Delhi       India  B.A   Physics
M Chowdhury
A Chow            Perth  Austrailia  PHD     Maths
David           Colombo   Sri Lanka  BBM   Parmacy
Samyaul Hridoy  Newyork         USA  Bsc  Medicine

In [17]:
pd.read_excel("Student.xlsx",index_col=0,sheet_name='teacher',skiprows=[0,1],names=['Name','City','Country','Degree','Specialization'])

                   City     Country Degree Specialization
Name
A Chow            Perth  Austrailia    PHD          Maths
David           Colombo   Sri Lanka    BBM        Parmacy
Samyaul Hridoy  Newyork         USA    Bsc       Medicine

In [18]:
teacher=pd.read_excel("Student.xlsx",index_col=0,sheet_name='teacher')

In [19]:
teacher.head(3)

                 City     Country Degree Specialization
Manish Sharma  Mumbai       India    MSC          Maths
M Chowdhury     Delhi       India    B.A        Physics
A Chow          Perth  Austrailia    PHD          Maths

In [20]:
teacher.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, Manish Sharma to Samyaul Hridoy
Data columns (total 4 columns):
City              5 non-null object
Country           5 non-null object
Degree            5 non-null object
Specialization    5 non-null object
dtypes: object(4)
memory usage: 200.0+ bytes

In [21]:
teacher.describe()

         City Country Degree Specialization
count       5       5      5              5
unique      5       4      5              4
top     Delhi   India    BBM          Maths
freq        1       2      1              2

In [22]:
teacher.to_csv('teacher.csv')